"""
1. Рецепт, который вы читаете, указывает, сколько граммов вам нужно для ингредиента. 
 К сожалению, ваш магазин продает товары только в унциях.  
Создайте функцию для преобразования граммов в унции. унций = 28,3495231 * грамм 
""" 
def sep (магазин): 
    print(f"унция = {28.3495231 * x}") 
 
x = float(input("сколько граммов: ")) 
 
sep(x)