""" 
13.Напишите программу, способную играть в игру «Угадай число», 
 где число, подлежащее угадыванию, выбирается случайным образом между 1 и 20. 
  Вот как это должно работать при запуске в терминале: 
 Привет! Как Вас зовут? 
 КБТУ 
 
 Ну, КБТУ, я имею в виду число от 1 до 20. 
 Догадайтесь. 
    12 
 
 Ваша догадка слишком низкая. 
 Догадайтесь. 
    16 
 
 Ваша догадка слишком низкая. 
 Догадайтесь. 
    19 
    Молодец, КБТУ! Вы угадали мое число в 3 догадках! 
Создайте файл python и импортируйте некоторые функции из вышеуказанных 13 задач и попробуйте их использовать.
"""