# Словарь фильмов

фильмы = [
{
"имя": "Обычные подозреваемые",
"imdb": 7.0,
"категория": "Триллер"
},
{
"имя": "Киллер",
"imdb": 6.3,
"категория": "Действие"
},
{
"имя": "Темный рыцарь",
"imdb": 9.0,
"категория": "Приключение"
},
{
"имя": "Помощь",
"imdb": 8.0,
"категория": "Драма"
},
{
"имя": "Выбор",
"imdb": 6.2,
"категория": "Романтика"
},
{
"имя": "Колония",
"imdb": 7.4,
"категория": "Романтика"
},
{
"имя": "Любовь",
"imdb": 6.0,
"категория": "Романтика"
},
{
"имя": "Войны невест",
"imdb": 5.4,
"категория": "Романтика"
},
{
"имя": "АльфаДжет",
"imdb": 3.2,
"категория": "Война"
},
{
"имя": "Звенящее преступление",
"imdb": 4.0,
"категория": "Преступление"
},
{
"имя": "Шутя гадость",
"imdb": 7.2,
"категория": "Комедия"
},
{
"имя": "Что такое имя",
"imdb": 9.2,
"категория": "Саспенс"
},
{
"имя": "Детектив",
"imdb": 7.0,
"категория": "Саспенс"
},
{
"имя": "Экзамен",
"imdb": 4.2,
"категория": "Триллер"
},
{
"имя": "Мы двое",
"imdb": 7.2,
"категория": "Романтика"
}
]
#1
def func1(movie):
    if movie["imdb"]>5.5:
        return True
    return False

